Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་དགའ་བར་བྱས་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then, the Buddha, having delighted those bodhisattvas with greetings, declared,

source: །རིགས་ཀྱི་བུ་དག་རང་རང་གི་སེང་གེའི་ཁྲི་ལ་འཁོད་ཅིག
en: “Noble sons, be seated upon your thrones!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་དེ་དག་འཁོད་དོ།
en: Thus commanded by the Buddha, they took their thrones.

source: །བཅོམ་ལྡན་འདས་སྔོན་མ་མནམས་པའི་དྲི་ཞིག་གདའ་ན་འདི་ལྟ་བུ་སུའི་དྲི་ལགས།
en: “Lord, what is this perfume, the likes of which I have never smelled before?”

source: །ཤཱ་རིའི་བུས་ཀྱང་སྨྲས་པ།
en: Śāriputra added,

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ཁོ་བོ་ཅག་གི་ལུས་ཀྱི་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་ཀྱང་འདི་ལྟ་བུའི་དྲི་བྱུང་ངོ་།
en: “Venerable Ānanda, this same perfume emanates from all our pores as well!”

source: །བདག་ཀྱང་དད་ཅིང་ངོ་མཚར་དུ་གྱུར་ཏེ། སྐྱེས་བུ་དམ་པ་དེའི་རྐང་པ་ལ་ཕྱག་བགྱིས་ནས་
en: And I, full of astonishment, having saluted this good man by touching his feet with my head,

source: །འདི་ལོང་ལ་གང་ལ་མོས་པ་ལ་བྱིན་ཅིག་ཅེས་བགྱིས་པ་དང་།
en: ‘Please accept, good man, this necklace of pearls, out of compassion for me, and give it to whomsoever you wish.

source: །སྦྱིན་པ་པོ་སྦྱིན་བདག་གང་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་སྦྱིན་གནས་སུ་འདུ་ཤེས་པ་དེ་འདྲ་བར་གྲོང་ཁྱེར་གྱི་དབུལ་པོ་དང་ཐ་དད་པ་མེད་པར་མཉམ་ཞིང་སྙིང་རྗེ་ཆེན་པོའི་སེམས་དང་། རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བས་ཡོངས་སུ་གཏོང་བ་དེ་ནི་ཆོས་ཀྱི་མཆོད་སྦྱིན་ཡོངས་སུ་རྫོགས་པའོ་ཞེས་བགྱིས་པ་དང་།
en: ‘The giver who makes gifts to the lowliest poor of the city, considering them as worthy of offering as the Tathāgata himself, and the giver who gives without any discrimination, impartially, with no expectation of reward, and with great love—that giver, I say, totally fulfills the Dharma-sacrifice.’

source: །དྲི་འདི་ཇི་སྲིད་ཀྱི་བར་དུ་ཆགས་པར་འགྱུར།
en: “How long will this perfume remain?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གིས་ལུས་ཀྱི་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་དྲི་བྱུང་བ་ཡིན་ནོ།
en: The Buddha answered, “Ānanda, this perfume emanates from all the pores of all these bodhisattvas.”

source: དེ་ནས་ཡང་ཞག་བདུན་གྱི་བར་དུ་དེས་མདངས་རྒྱས་པར་འགྱུར་རོ།
en: and its perfume will emanate for seven days more after that,

source: །མ་ཞུ་བའི་གནོད་པར་ཡང་མི་འགྱུར་རོ།
en: but there will be no trouble of indigestion during that time.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ལིད་ཙ་བཱི་དྲི་མི་མེད་པར་གྲགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the venerable Ānanda addressed the Licchavi Vimalakīrti:

source: །བཙུན་པ་ཀུན་དགའ་བོ་དགེ་སློང་གང་ངེས་པ་ལ་མ་ཞུགས་པས་ཟས་འདི་ཟོས་ན་དེ་དག་ངེས་པ་ལ་ཞུགས་ན་དེ་འཇུ་བར་འགྱུར་རོ།
en: Furthermore, reverend Ānanda, if monks who have not entered destiny for the ultimate eat this food, it will be digested when they enter that destiny.

source: ཆོས་ཀྱི་དབྱིངས་སུ་གཉིས་སུ་མ་མཆིས་ཤིང་དབྱེར་མ་མཆིས་པའི་སྤྱོད་ཡུལ་གྱི་དམ་པའི་མཆོག་ཐོབ་པ་
en: He has attained the supreme excellence of the indivisible, nondual sphere of the ultimate realm.

source: ཆོས་ཀྱི་དབྱིངས་བཀོད་པ་གཅིག་པ་རྣམ་པ་མཐའ་ཡས་པའི་བཀོད་པར་ཆོས་སྟོན་པ་ལ་མཁས་པ།
en: He is skilled in teaching the Dharma with its infinite modalities within the uniform ultimate.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་བཀོད་པ་འཐོབ་པར་བགྱིད་པ་འཚལ་བ་ལ་མཁས་པ།
en: He is skilled in granting means of attainment in accordance with the spiritual faculties of all living beings.

source: ཐབས་མཁས་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ།
en: He has thoroughly integrated his realization with skill in liberative art.

source: སངས་རྒྱས་གཤེགས་པར་ཡང་དག་པར་གཞོལ་བར་བྱའི་ཉན་ཐོས་འགྲོ་བར་ཡང་དག་པར་གཞོལ་བར་མི་བྱའོ།
en: They should follow the way of the buddhas, not the way of the disciples.

source: དྲིས་པ་གཏན་ལ་འབེབས་པ་ཐོབ་པ་སྟེ།
en: He has attained decisiveness with regard to all questions.

source: །གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་དེ་ལྟར་ཡུལ་འཁོར་གྱི་བསོད་སྙོམས་དོན་ཡོད་པར་བཟའོ་ཞེས་
en: Only in this way, Elder Mahākāśyapa, is the practice of eating by alms meaningful.’

source: །སེམས་ཅན་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པ་གང་དག་གིས་དེ་ཟོས་པ་དེ་དག་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན་དེ་འཇུ་བར་འགྱུར་རོ།
en: If living beings who have not conceived the spirit of unexcelled, perfect enlightenment eat this food, it will be digested when they conceive the spirit of unexcelled, perfect enlightenment.

source: །བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་གང་དག་གིས་ཟོས་པ་དེ་དག་བཟོད་པ་མ་ཐོབ་ཀྱི་བར་དུ་མི་འཇུའོ།
en: If those who have conceived the spirit of perfect enlightenment eat this food, it will not be digested until they have attained tolerance.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then, the venerable Ānanda said to the Buddha,

source: །བཅོམ་ལྡན་འདས་ཞལ་ཟས་འདི་ནི་སངས་རྒྱས་ཀྱི་མཛད་པ་བགྱིད་དོ།
en: “Lord, it is wonderful that this food accomplishes the work of the Buddha!”

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: and thought, ‘Reverence to all bodhisattvas!

source: །ཁྱིམ་ན་གནས་པ་ཡང་འདི་ལྟ་བུའི་སྤོབས་པ་དང་ལྡན་ན།
en: If a lay bodhisattva may be endowed with such eloquence,

source: དེ་ནི་གོ་ཆེ་ཆུང་ངུས་མགུ་བར་མི་ནུས་ཀྱི། འོན་ཀྱང་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་དེར་མཆིས་ཏེ་ཡང་དག་པ་ཇི་ལྟ་བ་དང་། མཐུ་ཇི་ལྟ་བ་བཞིན་དུ་བཤད་པར་འཚལ་ལོ།
en: Thus, although he cannot be withstood by someone of my feeble defenses, still, sustained by the grace of the Buddha, I will go to him and will converse with him as well as I can.”

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། སྐྱེས་བུ་དམ་པ་དེ་གཉིས་སྨྲ་བ་ལས། དེར་ནི་ཆོས་བསྒྲགས་པའི་གཏམ་ཆེན་པོ་གདོན་མི་ཟ་བར་འབྱུང་ངོ་སྙམ་སྟེ་
en: “Surely the conversations of the crown prince Mañjuśrī and that good man will result in a profound teaching of the Dharma.”

source: །དེ་ནས་འཁོར་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་དང་། ལྷའི་བུ་དེ་དག་དང་། ལྷའི་བུ་མོ་དེ་དག་འདི་སྙམ་དུ་སེམས་སོ།
en: Thereupon, in that assembly, the bodhisattvas, the great disciples, the Śakras, the Brahmās, the Lokapālas, and the gods and goddesses, all had this thought:

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་དང་།
en: Thus, eight thousand bodhisattvas,

source: ཉན་ཐོས་ལྔ་བརྒྱ་ཙམ་དང་།
en: five hundred disciples,

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཤིན་ཏུ་མང་བ་དང་། ལྷའི་བུ་བརྒྱ་སྟོང་ཕྲག་ཤིན་ཏུ་མང་པོ་རྣམས་ཆོས་མཉན་པའི་ཕྱིར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ཕྱི་བཞིན་དོང་ངོ་།
en: a great number of Śakras, Brahmās, Lokapālas, and many hundreds of thousands of gods and goddesses, all followed the crown prince Mañjuśrī to listen to the Dharma.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་དང་། ལྷའི་བུ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོར་ཞུགས་སོ།
en: And the crown prince Mañjuśrī, surrounded and followed by these bodhisattvas, disciples, Śakras, Brahmās, Lokapālas, gods, and goddesses, entered the great city of Vaiśālī.

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Meanwhile, the Licchavi Vimalakīrti thought to himself,

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འཁོར་མང་པོ་དང་འོང་གིས་བདག་གི་ཁྱིམ་འདི་སྟོང་པར་བྱིན་གྱིས་བརླབ་པོ་སྙམ་སྟེ།
en: “Mañjuśrī, the crown prince, is coming here with numerous attendants. Now, may this house be transformed into emptiness!”

source: དེས་ཁྱིམ་དེ་སྟོང་པར་བྱིན་གྱིས་བརླབས་ནས་དེ་ན་སྒོ་བའང་མེད་དོ།
en: Then, magically his house became empty. Even the doorkeeper disappeared.

source: །གལ་ཏེ་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ལོག་པ་ཉིད་བརྒྱད་ལས་ཀྱང་མི་འདའ་ཞིང་རྣམ་པར་ཐར་པ་བརྒྱད་ལའང་སྙོམས་པར་འཇུག་ཅིང་ལོག་པའི་མཉམ་པ་ཉིད་ཀྱིས་ཡང་དག་པའི་མཉམ་པ་ཉིད་ལ་འཇུག་པ་དང་།
en: “ ‘Elder Mahākāśyapa, if, equipoised in the eight liberations without transcending the eight perverse paths, you can enter the sameness of reality by means of the sameness of perversity,

source: བསོད་སྙོམས་གཅིག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱིན་ཞིང་སངས་རྒྱས་ཐམས་ཅད་དང་འཕགས་པ་ཐམས་ཅད་ལ་ཡང་དབུལ་ཏེ།
en: and if you can make a gift to all living beings and an offering to all the noble ones and buddhas out of even a single measure of alms,

source: གང་མཐོང་བ་དེ་ནི་ཕྱིར་ཡང་བལྟ་བར་བྱ་བ་མ་ཡིན་པའི་ཕྱིར་རོ།
en: What is seen is not to be seen again, ultimately.

source: །སྐྱེས་བུ་དམ་པ་ཁྱོད་བཟོད་དམ།
en: “Good sir, is your condition tolerable?

source: འཚོ་འམ།
en: Is it livable?

source: སུ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མི་སྐྱེད་སྙམ་ནས་དེ་ཚུན་ཆད་བདག་གིས་སེམས་ཅན་གང་ཡང་ཐེག་པ་ཆེན་པོ་མ་ལགས་པར་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་སྔོན་ཆད་མ་བཙུད་དོ།
en: who is there who would not conceive the spirit of unexcelled, perfect enlightenment?’ From that time forth, I no longer recommend the vehicles of the disciples and of the solitary sages but recommend the Mahāyāna.

source: ཁྱོད་ཀྱི་ཁམས་རྣམས་མི་འཁྲུག་གམ།
en: Are your physical elements not disturbed?

source: ཁྱོད་ཀྱི་ནད་དེ་འབྱུང་ངམ།
en: Is your sickness diminishing?

source: མི་སྐྱེ་འམ།
en: Is it not increasing?

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the venerable Subhūti,

source: །ཁྱིམ་བདག་ཁྱོད་ཀྱི་ནད་འདི་ཅི་ལས་བྱུང་།
en: “Householder, whence came this sickness of yours?

source: བྱུང་ནས་ཅི་སྲིད་ལོན།
en: How long will it continue?

source: །ལོ་ཙྪ་བ་བན་དེ་ཆོས་ཉིད་ཚུལ་ཁྲིམས་ཀྱིས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: and was translated, edited, and established by the monk Chönyi Tsultrim.

source: །།ཤུ་ལོ་ཀ་སྟོང་བརྒྱད་བརྒྱ་སྟེ་བམ་པོ་དྲུག་གོ།
en: It has 1,800 ślokas in six fascicles,

source: བཅོམ་ལྡན་འདས་ཀྱང་ཁྱོད་ལ་གནོད་པ་ཆུང་ངམ།
en: The Buddha asks about you—if you have slight trouble,

source: རབ་འབྱོར་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: “Subhūti, go to the Licchavi Vimalakīrti to inquire about his illness.”

source: ཉམ་ང་བ་ཉུང་ངམ། ན་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོ་བ་དང་། སྟོབས་དང་། བདེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་དང་། བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་གསུང་ངོ་།
en: slight discomfort, slight sickness, if your distress is light, if you are cared for, strong, at ease, without self-reproach, and if you are living in touch with the supreme happiness.

source: །རབ་འབྱོར་གྱིས་ཀྱང་གསོལ་པ།
en: Subhūti replied,

source: །གང་སོང་བ་དེ་ཡང་ཕྱིས་མི་འགྲོའོ།
en: Who goes, ultimately goes not.

source: བཅོམ་ལྡན་འདས་བདག་སྐྱེས་བུ་དམ་པ་དེའི་བྲོ་འདྲི་ཞིང་འཆི་བར་མི་སྤྲོའོ།
en: “Lord, I am indeed reluctant to go to this good man to inquire about his illness.

source: གང་འོངས་པ་དེ་ནི་ཕྱིས་མི་འོང་ངོ་།
en: Who comes, ultimately comes not.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བདག་གིས་མངོན་པར་འཚལ་བ་དུས་གཅིག་ན།
en: Why? My Lord, I remember one day,

source: །འཇམ་དཔལ་གྱིས་སྨྲས་པ་ཁྱིམ་བདག་ཇི་སྐད་ཟེར་བ་དེ་བཞིན་ཏེ།
en: Mañjuśrī declared, “Householder, it is as you say.

source: ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོར་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ཁྱིམ་དུ་བསོད་སྙོམས་ལ་མཆིས་པ་དང་།
en: when I went to beg my food at the house of the Licchavi Vimalakīrti in the great city of Vaiśālī,

source: ཇི་ལྟར་གནས།
en: How does it stand?

source: ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་བདག་གི་ལྷུང་བཟེད་འཚལ་ནས་ཟས་བཟང་པོས་བཀང་སྟེ་འདི་སྐད་ཅེས་མཆིའོ།
en: he took my bowl and filled it with some excellent food and said to me,

source: ཅི་ཙམ་ན་ཞི་བར་འགྱུར།
en: How can it be alleviated?”

source: དྲི་མ་མེད་པར་གྲགས་པས་སྨྲས་པ།
en: Vimalakīrti replied,

source: འཇམ་དཔལ་མ་རིག་པ་དང་། སྲིད་པའི་སྲེད་པ་ཇི་སྲིད་པར་ཁོ་བོའི་ནད་འདི་འང་དེ་སྲིད་དོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་ཇི་སྲིད་པར་ཁོ་བོའི་ནད་ཀྱང་དེ་སྲིད་དོ།
en: “Mañjuśrī, my sickness comes from ignorance and the thirst for existence and it will last as long as do the sicknesses of all living beings.

source: །ནམ་སེམས་ཅན་ཐམས་ཅད་ནད་དང་བྲལ་བར་གྱུར་པ་དེ་ན་ཁོ་བོའི་ནད་ཀྱང་འབྱུང་ངོ་།
en: Were all living beings to be free from sickness, I also would not be sick.

source: །ནམ་སེམས་ཅན་ཐམས་ཅད་ནད་དང་བྲལ་བར་གྱུར་པ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ནད་མེད་པར་འགྱུར་རོ།
en: Were all living beings free of sickness, the bodhisattva also would be free of sickness.

source: གལ་ཏེ་འཇིག་ཚོགས་ལ་ལྟ་བའང་མ་བསྐྱོད་ལ་བགྲོད་པ་གཅིག་པའི་ལམ་དུ་ཡང་སོང་།
en: if you can follow the path of the single way without ever disturbing the egoistic views;

source: །འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན་ཚོང་དཔོན་གྱི་བུ་གཅིག་པ་ན་བར་གྱུར་ན་དེ་ན་བའི་ཕྱིར་ཕ་མ་གཉིས་ཀྱང་ན་བར་འགྱུར་རོ།
en: For example, Mañjuśrī, when the only son of a merchant is sick, both his parents become sick on account of the sickness of their son.

source: ཁྱོད་ཀྱིས་མ་རིག་པ་དང་སྲིད་པའི་སྲེད་པ་ཡང་མ་བཅོམ་ལ་རིག་པ་དང་རྣམ་པར་གྲོལ་བ་ཡང་མ་སྐྱེད།
en: if, neither conquering ignorance and the craving for existence, nor producing knowledge and liberation,

source: མཚམས་མེད་པའི་མཉམ་པ་ཉིད་དང་། ཁྱོད་ཀྱི་རྣམ་པར་གྲོལ་བ་ཡང་མཚུངས། ཁྱོད་གྲོལ་བ་ཡང་མ་ཡིན་ལ་བཅིངས་པ་ཡང་མ་ཡིན།
en: your liberation being the same as the equality of the uninterruptible sins, you are neither liberated nor bound;

source: ཁྱོད་ཀྱིས་འཕགས་པའི་བདེན་པ་བཞི་འང་མ་མཐོང་ལ་བདེན་པ་མ་མཐོང་བ་ཡང་མ་ཡིན།
en: if you do not see the four noble truths, yet are not one who “has not seen the truth”;

source: འབྲས་བུ་ཐོབ་པའང་མ་ཡིན་ལ་སོ་སོའི་སྐྱེ་བོའང་མ་ཡིན་སོ་སོའི་སྐྱེ་བོའི་ཆོས་ལས་ཀྱང་མ་ལོག
en: if you are also neither “one who has attained fruition,” nor “an ordinary person,” while not having eliminated the qualities of “an ordinary person”;

source: །ཁྱོད་འཕགས་པའང་མ་ཡིན་ལ་མ་འཕགས་པའང་མ་ཡིན།
en: if you are not a noble one, and not a non-noble one;

source: ཆོས་ཐམས་ཅད་དང་ཡང་ལྡན་ལ་ཆོས་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་དང་ཡང་བྲལ།
en: and if, though you are in the presence of all things, you are free of any notion of “all things.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then the Buddha said to the venerable Ānanda,

source: །ཆོས་སྨྲ་བ་དེའི་དཔག་ཚད་ཁོར་ཡུག་ཏུ་ཅི་ནས་ཀྱང་ཆོས་སྨྲ་བ་དེ་ལ་གླགས་ལྟ་བ་དང་། ཀླན་ཀ་ཚོལ་བ་གང་གིས་ཀྱང་གླགས་མི་རྙེད་པར་བསྲུང་བར་བགྱིའོ།
en: And we will protect the teachers of this Dharma for a radius of one league so that no one who plots injury or disruption against these teachers will have any opportunity to do them harm.”

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: and how should I remember it?”

source: །ཁྱོད་མི་ཁོམ་པ་བརྒྱད་དུ་ཡང་འཇུག་ལ་དལ་བ་ཐོབ་པ་ཡང་མེད།
en: if, bound up in the eight adversities, you do not obtain favorable conditions;

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: Thus spoke the Buddha.

source: ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དང་།
en: And the Licchavi Vimalakīrti,

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་།
en: the crown prince Mañjuśrī,

source: ཁྱོད་ཀུན་ནས་ཉོན་མོངས་པ་དང་ཡང་མཉམ་པར་གྱུར་ལ་རྣམ་པར་བྱང་བ་ཡང་ཁོང་དུ་མ་ཆུད།
en: if, assimilating the passions, you do not attain purification;

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་།
en: the venerable Ānanda, the bodhisattvas,

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་།
en: the great disciples,

source: གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་མེད་པ་དེ་བཙུན་པའི་ཡང་ཉོན་མོངས་པ་མེད་པ་ཡིན།
en: if the dispassion of all living beings is your dispassion, reverend;

source: ཁྱོད་ཀྱི་སྦྱིན་པ་ཡང་རྣམ་པར་མ་སྦྱངས།
en: if those who make offerings to you are not thereby purified;

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་།
en: the entire multitude, and the whole universe with its gods, men, asuras,

source: བཙུན་པ་ཁྱོད་ལ་སུ་དག་བསོད་སྙོམས་སྦྱིན་པར་བྱེད་པ་དེ་དག་ཀྱང་ལོག་པར་ལྷུང་བར་བྱེད།
en: if those who offer you food, reverend, still fall into the three bad migrations;

source: ཁྱོད་བདུད་ཐམས་ཅད་དང་ཡང་ལྷན་ཅིག
en: if you associate with all māras;

source: ཀུན་དགའ་བོ་དེ་དེ་བཞིན་ཏེ།
en: “So it is, Ānanda!

source: ཇི་སྐད་སྨྲས་པ་དེ་དེ་བཞིན་ནོ།
en: It is as you say,

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་མི་སྙན་པར་བྱས།
en: if you criticize all the teachings of the Buddha;

source: བསྟན་པ་འདི་དེ་ལས་ཐོས་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་བདག་གིས་ཇི་སྐད་བཤད།
en: “Lord, when I heard these words of the Licchavi Vimalakīrti, I wondered what I should say

source: ཇི་ལྟར་བགྱི་སྙམ་སྟེ། ཕྱོགས་བཅུ་མུན་པར་གྱུར་ནས་
en: and what I should do, but I was totally in the dark.

source: །གང་འཇམ་དཔལ་ཁྱོད་ནད་འདི་ཅི་ལས་བྱུང་ཞེས་ཟེར་བ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནད་ནི་སྙིང་རྗེ་ཆེན་པོ་ལས་བྱུང་ངོ་།
en: You ask me, Mañjuśrī, whence comes my sickness; the sicknesses of the bodhisattvas arise from great compassion.”

source: །བཙུན་པ་རབ་འབྱོར་ཡི་གེ་དག་ལ་མ་འཇིགས་པར་ལྷུང་བཟེད་འདི་ལོང་ཤིག
en: ‘Reverend Subhūti, do not fear these words, and pick up your bowl.

source: སེམས་ཅན་ཐམས་ཅད་ན་བས་དེ་ཡང་ན་བར་འགྱུར། སེམས་ཅན་ལ་ནད་མེད་ན་དེ་ཡང་ན་བ་མེད་དོ།
en: He becomes sick when they are sick and is cured when they are cured.

source: །བཙུན་པ་རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས།
en: What do you think, reverend Subhūti?

source: །འཇམ་དཔལ་གང་ཁྱོད་ལ་གཡོག་ཀྱང་མེད་དམ་ཞེས་ཟེར་བ་ནི་བདུད་ཐམས་ཅད་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ནི་ཁོ་བོའི་གཡོག་ཡིན་ནོ།
en: Mañjuśrī, you ask me why I am without servants, but all māras and opponents are my servants.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ལ་དེ་སྐད་བྱས་ན་དེ་ཇི་སྐྲག་པར་འགྱུར་རམ་བདག་གིས་དེ་ལ་རིགས་ཀྱི་བུ་དེ་ལྟ་མ་ཡིན་ནོ་ཞེས་བགྱིས་སོ།
en: If it were an incarnation created by the Tathāgata who spoke thus to you, would you be afraid?’“I answered, ‘No indeed, noble sir!’

source: །དེས་བདག་ལ་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་སྒྱུ་མ་སྤྲུལ་པའི་རང་བཞིན་གྱི་ཆོས་ཐམས་ཅད་ལ་སྐྲག་པར་མ་བྱེད་ཅིག
en: He then said, ‘Reverend Subhūti, the nature of all things is like illusion, like a magical incarnation. So you should not fear them.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚིག་དེ་དག་ཐམས་ཅད་ཀྱང་དེའི་རང་བཞིན་ཏེ།
en: Why? All words also have that nature,

source: །དེ་བས་ན་བདུད་ཐམས་ཅད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ནི་ཁོ་བོའི་གཡོག་གོ།
en: Therefore, all māras and opponents are my servants.

source: །ཕས་ཀྱི་རྒོལ་བ་རྣམས་ནི་ལྟ་བར་གྱུར་པ་རྣམས་ཀྱི་བསྔགས་པ་སྨྲ་བ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ནི་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་ལས་མི་གཡོའོ།
en: The outsider opponents advocate convictions, and the bodhisattva is not troubled by convictions.

source: སྔོན་གྱི་མཐའི་མུའི་སྡུག་བསྔལ་རྗེས་སུ་དྲན་པ་དང་།
en: his remembrance of suffering experienced from beginningless time,

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་ཁྱོད་ཀྱིས་གསད་པའི་སེམས་ཉེ་བར་གཞག །སངས་རྒྱས་ཐམས་ཅད་ལ་ཡང་ཁྱོད་ཀྱིས་སྐུར།
en: if you have hostile feelings toward all living beings; if you despise all the buddhas;

source: །བདག་ན་བས་སེམས་ཅན་གཞན་ན་བ་ལ་སྙིང་རྗེ་བ་དང་།
en: He should encourage his empathy for all living beings on account of his own sickness,

source: །ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་ཁྱོད་ཀྱི་གྲོགས་སུ་གྱུར། ཉོན་མོངས་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་བཙུན་པའི་ངོ་བོ་ཉིད་ཀྱང་དེ་ཡིན།
en: if you entertain all passions; if the nature of passions is the nature of a reverend;

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་ཀྱི་ནང་དུ་ཡང་ཁྱོད་ཆུད་ཅིང་མཐའ་དང་དབུས་ཀྱང་མི་རྙེད་དོ།
en: if, entertaining all false views, you find neither extremes nor middle;

source: །ལུས་བདག་མེད་པ་སྟེ། འོན་ཀྱང་སེམས་ཅན་སྨིན་པར་བྱ་བས་སོ། །ལུས་ཞི་བ་ཉིད་ཀྱིས་ཏེ། ཤིན་ཏུ་ཞི་བས་ནི་མ་ཡིན་ནོ།
en: that the body is selfless, but that living beings should be developed; that the body is peaceful, but not to seek any ultimate calm.

source: །བདག་ནི་ནད་དང་བྲལ་བར་བྱ་སྟེ། ནད་རབ་ཏུ་སྤང་བའི་ཕྱིར་བརྩོན་པར་བྱའོ།
en: I should free myself from this sickness and should strive to abandon it.’

source: ཕྱིན་ཅི་ལོག་ནི་ནད་ཆེན་པོའོ།
en: and this misunderstanding is also a grave sickness;

source: གང་བདག་གིས་འདི་ལྟར་ཆོས་སུ་འདུ་ཤེས་པ་དེ་ཡང་ཕྱིན་ཅི་ལོག་སྟེ།
en: ‘Just as in the case of the conception of “self,” so the conception of “thing” is also a misunderstanding,

source: །དེས་ཆོས་ཀྱི་འདུ་ཤེས་ཀུན་ཤེས་པར་བྱ་བའི་ཕྱིར་སེམས་བསྐྱེད་པར་བྱ་སྟེ།
en: “Furthermore, he should understand thoroughly the conception of himself as a thing by cultivating the following consideration:

source: དེ་དེ་ལྟར་རྟོག་པ་ན་ཕན་ཡོན་དུ་ལྟ་བར་མི་ལྟུང་ཞིང་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེ་སྟེ།
en: Through such considerations, he arouses the great compassion toward all living beings without falling into any sentimental compassion,

source: བློ་བུར་གྱི་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་མངོན་པར་བརྩོན་པའི་སྙིང་རྗེ་ཆེན་པོ་སེམས་ཅན་རྣམས་ལ་སྐྱེ་བ་ནི་མ་གཏོགས་སོ།
en: but instead, arouses great compassion toward all living beings through striving to eliminate the incidental afflictions.

source: དེ་ལྟར་མཁས་པ་དག་ཡི་གེ་རྣམས་ལ་ཡང་མི་ཆགས་ཤིང་དེ་དག་ལ་སྐྲག་པར་མི་བྱེད་པའི་ཕྱིར་རོ།
en: and thus the wise are not attached to words, nor do they fear them.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཡི་གེ་དེ་དག་ཐམས་ཅད་ནི་ཡི་གེ་མེད་པ་སྟེ།
en: Why? All language does not ultimately exist,

source: །ལྟ་བ་ཀུན་ནས་ལྡང་བ་ཀུན་ཏུ་ལྡང་ཞིང་མི་སྐྱེ་སྟེ། དེ་སེམས་ཀུན་ནས་ལྡང་བ་མེད་པར་སྐྱེ་བས་དེ་གྲོལ་བཞིན་དུ་སྐྱེ།
en: He does not reincarnate through involvement with such views but reincarnates with his mind free of involvement.

source: རྣམ་པར་གྲོལ་བ་ནི་མ་གཏོགས་སོ།
en: except as liberation.

source: འདི་ལྟ་སྟེ། ལྟ་བ་ཐམས་ཅད་དང་། ཉོན་མོངས་པ་ཀུན་ནས་ལྡང་བ་དང་། བག་ལ་ཉལ་བ་དང་། རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པའི་དགེ་བའི་རྩ་བ་རྩོམ་པ་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ལ་དེས་ཀྱང་མི་སྙེམས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱིས་ཟིན་པའི་ཐབས་ཏེ་གྲོལ་བའོ།
en: The liberation of liberative art integrated with wisdom consists of the bodhisattva’s dedication of his roots of virtue for the sake of enlightenment, without taking any pride therein, while forgoing all convictions, passions, attachments, resentments, and their subconscious instincts.

source: །ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་དོ།
en: The nature of all things is liberation.’

source: གང་སོ་སོའི་སྐྱེ་བོའི་སྤྱོད་ཡུལ་ཡང་མ་ཡིན། འཕགས་པའི་སྤྱོད་ཡུལ་ཡང་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: “Not the domain of the ordinary individual and not the domain of the arhat, such is the domain of the bodhisattva.

source: བདག་ཀྱང་སྤོབས་པ་མ་མཆིས་པར་གྱུར་ནས་དེ་ལ་སླར་ལན་ལྡོན་པའི་རྔོ་མི་ཐོགས་ཏེ།
en: As for me, I was speechless and unable to respond to him.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the venerable Pūrṇa­maitrāyaṇī­putra,

source: གང་པོ་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: “Pūrṇa, go to the Licchavi Vimalakīrti to inquire about his illness.”

source: །གང་པོས་ཀྱང་གསོལ་པ།
en: Pūrṇa replied,

source: བཅོམ་ལྡན་འདས་བདག་སྐྱེས་བུ་དམ་པ་དེའི་བྲོ་འདྲི་ཞིང་མཆི་བར་མི་སྤྲོའོ།
en: “Lord, I am indeed reluctant to go to this good man to inquire about his illness.

source: ནགས་ཚལ་ཆེན་པོའི་ས་ཕྱོགས་ཤིག་ན་ལས་དང་པོ་པའི་དགེ་སློང་དག་ལ་ཆོས་སྟོན་ཅིང་མཆིས་ན་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དེར་མཆིས་ནས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: when I was teaching the Dharma to some young monks in the great forest, the Licchavi Vimalakīrti came there and said to me,

source: །བཙུན་པ་གང་པོ་སྙོམས་པར་ཞུགས་ཏེ་དགེ་སློང་འདི་དག་གི་སེམས་ལྟོས་ལ་ཆོས་སྟོན་ཅིག
en: ‘Reverend Pūrṇa, first concentrate yourself, regard the minds of these young bhikṣus, and then teach them the Dharma!

source: །རིན་པོ་ཆེའི་སྣོད་ཆེན་པོར་ཟན་རུལ་མ་བླུགས་ཤིག
en: Do not put rotten food into a jeweled bowl!

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ཆོས་ནི་ཉེ་བར་ཞི་ཞིང་རབ་ཏུ་ཞི་བ་སྟེ།
en: “Reverend Śāriputra, the Dharma is calm and peaceful.

source: །དགེ་སློང་འདི་དག་གི་བསམ་པ་ཇི་ལྟ་བུ་ཤེས་པར་གྱིས་ལ་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་མཆིང་བུའི་ནོར་བུ་དང་མཚུངས་པར་མ་བྱེད་ཅིག
en: First understand the inclinations of these monks, and do not confuse priceless sapphires with glass beads!

source: དེ་ལ་གང་དག་སྐྱེ་བ་དང་འཇིག་པ་ལ་སྤྱོད་པ་དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན། དབེན་པ་འདོད་པ་མ་ཡིན་ཏེ། དེ་ནི་སྐྱེ་བ་དང་འཇིག་པ་འདོད་པའོ།
en: Those who are engaged in production and destruction are not interested in the Dharma, are not interested in solitude, but are interested in production and destruction.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་ཆོས་ནི་རྡུལ་མེད་ཅིང་རྡུལ་དང་བྲལ་བ་སྟེ།
en: “Furthermore, reverend Śāriputra, the Dharma is without taint and free of defilement.

source: དེ་ལ་གང་དག་ཆོས་གང་ལ་ཆགས་ན་ཐ་ན་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་རུང་སྟེ། དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན་གྱི། དེ་དག་ནི་འདོད་ཆགས་ཀྱི་རྡུལ་འདོད་པའོ།
en: He who is attached to anything, even to liberation, is not interested in the Dharma but is interested in the taint of desire.

source: ། ཆོས་ནི་ཡུལ་མ་ཡིན་ཏེ།
en: The Dharma is not an object.

source: གང་དག་ཡུལ་འགྲང་བ་དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན་གྱི། དེ་དག་ནི་ཡུལ་འདོད་པའོ།
en: He who pursues objects is not interested in the Dharma but is interested in objects.

source: །བཙུན་པ་གང་པོ་སེམས་ཅན་གྱི་དབང་པོ་དག་ལ་མ་བརྟགས་པར་ཉི་ཚེ་བའི་དབང་པོ་ཉེ་བར་མ་སྒྲུབ་ཤིག
en: “ ‘Reverend Pūrṇa, without examining the spiritual faculties of living beings, do not presume upon the one-sidedness of their faculties;
